/*Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
m = 2, n = 3 -> A(m,n) = 9
m = 3, n = 2 -> A(m,n) = 29*/
int Akker(int n, int m)
{
  if (n == 0)
    return m + 1;
  else
    if ((n != 0) && (m == 0))
      return Akker(n - 1, 1);
    else
      return Akker(n - 1, Akker(n, m - 1));
};
int result;
result = Akker(2, 3); // res = 4
Console.WriteLine($"Аккерман : {result}");
result = Akker(3, 2); // res = 2
Console.WriteLine($"Аккерман : {result}");

